GopalSaraf/Practicals/PSDL/include/proc/pic18f85j90.inc
// Register: SPBRG2
#define SPBRG2 SPBRG2
SPBRG2                                   equ 0F64h

// Register: CCP2CON
#define CCP2CON CCP2CON
CCP2CON                                  equ 0F65h
// bitfield definitions
CCP2CON_CCP2M_POSN                       equ 0000h
CCP2CON_CCP2M_POSITION                   equ 0000h
CCP2CON_CCP2M_SIZE                       equ 0004h
CCP2CON_CCP2M_LENGTH                     equ 0004h
CCP2CON_CCP2M_MASK                       equ 000Fh
CCP2CON_DC2B_POSN                        equ 0004h
CCP2CON_DC2B_POSITION                    equ 0004h
CCP2CON_DC2B_SIZE                        equ 0002h
CCP2CON_DC2B_LENGTH                      equ 0002h
CCP2CON_DC2B_MASK                        equ 0030h
CCP2CON_CCP2M0_POSN                      equ 0000h
CCP2CON_CCP2M0_POSITION                  equ 0000h
CCP2CON_CCP2M0_SIZE                      equ 0001h
CCP2CON_CCP2M0_LENGTH                    equ 0001h
CCP2CON_CCP2M0_MASK                      equ 0001h
CCP2CON_CCP2M1_POSN                      equ 0001h
CCP2CON_CCP2M1_POSITION                  equ 0001h
CCP2CON_CCP2M1_SIZE                      equ 0001h
CCP2CON_CCP2M1_LENGTH                    equ 0001h
CCP2CON_CCP2M1_MASK                      equ 0002h
CCP2CON_CCP2M2_POSN                      equ 0002h
CCP2CON_CCP2M2_POSITION                  equ 0002h
CCP2CON_CCP2M2_SIZE                      equ 0001h
CCP2CON_CCP2M2_LENGTH                    equ 0001h
CCP2CON_CCP2M2_MASK                      equ 0004h
CCP2CON_CCP2M3_POSN                      equ 0003h
CCP2CON_CCP2M3_POSITION                  equ 0003h
CCP2CON_CCP2M3_SIZE                      equ 0001h
CCP2CON_CCP2M3_LENGTH                    equ 0001h
CCP2CON_CCP2M3_MASK                      equ 0008h
CCP2CON_DC2B0_POSN                       equ 0004h
CCP2CON_DC2B0_POSITION                   equ 0004h
CCP2CON_DC2B0_SIZE                       equ 0001h
CCP2CON_DC2B0_LENGTH                     equ 0001h
CCP2CON_DC2B0_MASK                       equ 0010h
CCP2CON_DC2B1_POSN                       equ 0005h
CCP2CON_DC2B1_POSITION                   equ 0005h
CCP2CON_DC2B1_SIZE                       equ 0001h
CCP2CON_DC2B1_LENGTH                     equ 0001h
CCP2CON_DC2B1_MASK                       equ 0020h
CCP2CON_DCCP2Y_POSN                      equ 0004h
CCP2CON_DCCP2Y_POSITION                  equ 0004h
CCP2CON_DCCP2Y_SIZE                      equ 0001h
CCP2CON_DCCP2Y_LENGTH                    equ 0001h
CCP2CON_DCCP2Y_MASK                      equ 0010h
CCP2CON_DCCP2X_POSN                      equ 0005h
CCP2CON_DCCP2X_POSITION                  equ 0005h
CCP2CON_DCCP2X_SIZE                      equ 0001h
CCP2CON_DCCP2X_LENGTH                    equ 0001h
CCP2CON_DCCP2X_MASK                      equ 0020h

// Register: CCPR2
#define CCPR2 CCPR2
CCPR2                                    equ 0F66h

// Register: CCPR2L
#define CCPR2L CCPR2L
CCPR2L                                   equ 0F66h

// Register: CCPR2H
#define CCPR2H CCPR2H
CCPR2H                                   equ 0F67h

// Register: CCP1CON
#define CCP1CON CCP1CON
CCP1CON                                  equ 0F68h
// bitfield definitions
CCP1CON_CCP1M_POSN                       equ 0000h
CCP1CON_CCP1M_POSITION                   equ 0000h
CCP1CON_CCP1M_SIZE                       equ 0004h
CCP1CON_CCP1M_LENGTH                     equ 0004h
CCP1CON_CCP1M_MASK                       equ 000Fh
CCP1CON_DC1B_POSN                        equ 0004h
CCP1CON_DC1B_POSITION                    equ 0004h
CCP1CON_DC1B_SIZE                        equ 0002h
CCP1CON_DC1B_LENGTH                      equ 0002h
CCP1CON_DC1B_MASK                        equ 0030h
CCP1CON_CCP1M0_POSN                      equ 0000h
CCP1CON_CCP1M0_POSITION                  equ 0000h
CCP1CON_CCP1M0_SIZE                      equ 0001h
CCP1CON_CCP1M0_LENGTH                    equ 0001h
CCP1CON_CCP1M0_MASK                      equ 0001h
CCP1CON_CCP1M1_POSN                      equ 0001h
CCP1CON_CCP1M1_POSITION                  equ 0001h
CCP1CON_CCP1M1_SIZE                      equ 0001h
CCP1CON_CCP1M1_LENGTH                    equ 0001h
CCP1CON_CCP1M1_MASK                      equ 0002h
CCP1CON_CCP1M2_POSN                      equ 0002h
CCP1CON_CCP1M2_POSITION                  equ 0002h
CCP1CON_CCP1M2_SIZE                      equ 0001h
CCP1CON_CCP1M2_LENGTH                    equ 0001h
CCP1CON_CCP1M2_MASK                      equ 0004h
CCP1CON_CCP1M3_POSN                      equ 0003h
CCP1CON_CCP1M3_POSITION                  equ 0003h
CCP1CON_CCP1M3_SIZE                      equ 0001h
CCP1CON_CCP1M3_LENGTH                    equ 0001h
CCP1CON_CCP1M3_MASK                      equ 0008h
CCP1CON_DC1B0_POSN                       equ 0004h
CCP1CON_DC1B0_POSITION                   equ 0004h
CCP1CON_DC1B0_SIZE                       equ 0001h
CCP1CON_DC1B0_LENGTH                     equ 0001h
CCP1CON_DC1B0_MASK                       equ 0010h
CCP1CON_DC1B1_POSN                       equ 0005h
CCP1CON_DC1B1_POSITION                   equ 0005h
CCP1CON_DC1B1_SIZE                       equ 0001h
CCP1CON_DC1B1_LENGTH                     equ 0001h
CCP1CON_DC1B1_MASK                       equ 0020h
CCP1CON_DCCP1Y_POSN                      equ 0004h
CCP1CON_DCCP1Y_POSITION                  equ 0004h
CCP1CON_DCCP1Y_SIZE                      equ 0001h
CCP1CON_DCCP1Y_LENGTH                    equ 0001h
CCP1CON_DCCP1Y_MASK                      equ 0010h
CCP1CON_DCCP1X_POSN                      equ 0005h
CCP1CON_DCCP1X_POSITION                  equ 0005h
CCP1CON_DCCP1X_SIZE                      equ 0001h
CCP1CON_DCCP1X_LENGTH                    equ 0001h
CCP1CON_DCCP1X_MASK                      equ 0020h

// Register: CCPR1
#define CCPR1 CCPR1
CCPR1                                    equ 0F69h

// Register: CCPR1L
#define CCPR1L CCPR1L
CCPR1L                                   equ 0F69h

// Register: CCPR1H
#define CCPR1H CCPR1H
CCPR1H                                   equ 0F6Ah

// Register: LCDDATA5
#define LCDDATA5 LCDDATA5
LCDDATA5                                 equ 0F6Bh
// bitfield definitions
LCDDATA5_LCDDATA5_POSN                   equ 0000h
LCDDATA5_LCDDATA5_POSITION               equ 0000h
LCDDATA5_LCDDATA5_SIZE                   equ 0008h
LCDDATA5_LCDDATA5_LENGTH                 equ 0008h
LCDDATA5_LCDDATA5_MASK                   equ 00FFh
LCDDATA5_S40C0_POSN                      equ 0000h
LCDDATA5_S40C0_POSITION                  equ 0000h
LCDDATA5_S40C0_SIZE                      equ 0001h
LCDDATA5_S40C0_LENGTH                    equ 0001h
LCDDATA5_S40C0_MASK                      equ 0001h
LCDDATA5_S41C0_POSN                      equ 0001h
LCDDATA5_S41C0_POSITION                  equ 0001h
LCDDATA5_S41C0_SIZE                      equ 0001h
LCDDATA5_S41C0_LENGTH                    equ 0001h
LCDDATA5_S41C0_MASK                      equ 0002h
LCDDATA5_S42C0_POSN                      equ 0002h
LCDDATA5_S42C0_POSITION                  equ 0002h
LCDDATA5_S42C0_SIZE                      equ 0001h
LCDDATA5_S42C0_LENGTH                    equ 0001h
LCDDATA5_S42C0_MASK                      equ 0004h
LCDDATA5_S43C0_POSN                      equ 0003h
LCDDATA5_S43C0_POSITION                  equ 0003h
LCDDATA5_S43C0_SIZE                      equ 0001h
LCDDATA5_S43C0_LENGTH                    equ 0001h
LCDDATA5_S43C0_MASK                      equ 0008h
LCDDATA5_S44C0_POSN                      equ 0004h
LCDDATA5_S44C0_POSITION                  equ 0004h
LCDDATA5_S44C0_SIZE                      equ 0001h
LCDDATA5_S44C0_LENGTH                    equ 0001h
LCDDATA5_S44C0_MASK                      equ 0010h
LCDDATA5_S45C0_POSN                      equ 0005h
LCDDATA5_S45C0_POSITION                  equ 0005h
LCDDATA5_S45C0_SIZE                      equ 0001h
LCDDATA5_S45C0_LENGTH                    equ 0001h
LCDDATA5_S45C0_MASK                      equ 0020h
LCDDATA5_S46C0_POSN                      equ 0006h
LCDDATA5_S46C0_POSITION                  equ 0006h
LCDDATA5_S46C0_SIZE                      equ 0001h
LCDDATA5_S46C0_LENGTH                    equ 0001h
LCDDATA5_S46C0_MASK                      equ 0040h
LCDDATA5_S47C0_POSN                      equ 0007h
LCDDATA5_S47C0_POSITION                  equ 0007h
LCDDATA5_S47C0_SIZE                      equ 0001h
LCDDATA5_S47C0_LENGTH                    equ 0001h
LCDDATA5_S47C0_MASK                      equ 0080h
LCDDATA5_SEG40COM0_POSN                  equ 0000h
LCDDATA5_SEG40COM0_POSITION              equ 0000h
LCDDATA5_SEG40COM0_SIZE                  equ 0001h
LCDDATA5_SEG40COM0_LENGTH                equ 0001h
LCDDATA5_SEG40COM0_MASK                  equ 0001h
LCDDATA5_SEG41COM0_POSN                  equ 0001h
LCDDATA5_SEG41COM0_POSITION              equ 0001h
LCDDATA5_SEG41COM0_SIZE                  equ 0001h
LCDDATA5_SEG41COM0_LENGTH                equ 0001h
LCDDATA5_SEG41COM0_MASK                  equ 0002h
LCDDATA5_SEG42COM0_POSN                  equ 0002h
LCDDATA5_SEG42COM0_POSITION              equ 0002h
LCDDATA5_SEG42COM0_SIZE                  equ 0001h
LCDDATA5_SEG42COM0_LENGTH                equ 0001h
LCDDATA5_SEG42COM0_MASK                  equ 0004h
LCDDATA5_SEG43COM0_POSN                  equ 0003h
LCDDATA5_SEG43COM0_POSITION              equ 0003h
LCDDATA5_SEG43COM0_SIZE                  equ 0001h
LCDDATA5_SEG43COM0_LENGTH                equ 0001h
LCDDATA5_SEG43COM0_MASK                  equ 0008h
LCDDATA5_SEG44COM0_POSN                  equ 0004h
LCDDATA5_SEG44COM0_POSITION              equ 0004h
LCDDATA5_SEG44COM0_SIZE                  equ 0001h
LCDDATA5_SEG44COM0_LENGTH                equ 0001h
LCDDATA5_SEG44COM0_MASK                  equ 0010h
LCDDATA5_SEG45COM0_POSN                  equ 0005h
LCDDATA5_SEG45COM0_POSITION              equ 0005h
LCDDATA5_SEG45COM0_SIZE                  equ 0001h
LCDDATA5_SEG45COM0_LENGTH                equ 0001h
LCDDATA5_SEG45COM0_MASK                  equ 0020h
LCDDATA5_SEG46COM0_POSN                  equ 0006h
LCDDATA5_SEG46COM0_POSITION              equ 0006h
LCDDATA5_SEG46COM0_SIZE                  equ 0001h
LCDDATA5_SEG46COM0_LENGTH                equ 0001h
LCDDATA5_SEG46COM0_MASK                  equ 0040h
LCDDATA5_SEG47COM0_POSN                  equ 0007h
LCDDATA5_SEG47COM0_POSITION              equ 0007h
LCDDATA5_SEG47COM0_SIZE                  equ 0001h
LCDDATA5_SEG47COM0_LENGTH                equ 0001h
LCDDATA5_SEG47COM0_MASK                  equ 0080h
LCDDATA5_S40C15_POSN                     equ 0000h
LCDDATA5_S40C15_POSITION                 equ 0000h
LCDDATA5_S40C15_SIZE                     equ 0001h
LCDDATA5_S40C15_LENGTH                   equ 0001h
LCDDATA5_S40C15_MASK                     equ 0001h

