GopalSaraf/Practicals/PSDL/include/proc/pic18f85j90.inc
// Register: TMR3H
#define TMR3H TMR3H
TMR3H                                    equ 0FB3h

// Register: CMCON
#define CMCON CMCON
CMCON                                    equ 0FB4h
// bitfield definitions
CMCON_CM_POSN                            equ 0000h
CMCON_CM_POSITION                        equ 0000h
CMCON_CM_SIZE                            equ 0003h
CMCON_CM_LENGTH                          equ 0003h
CMCON_CM_MASK                            equ 0007h
CMCON_CIS_POSN                           equ 0003h
CMCON_CIS_POSITION                       equ 0003h
CMCON_CIS_SIZE                           equ 0001h
CMCON_CIS_LENGTH                         equ 0001h
CMCON_CIS_MASK                           equ 0008h
CMCON_C1INV_POSN                         equ 0004h
CMCON_C1INV_POSITION                     equ 0004h
CMCON_C1INV_SIZE                         equ 0001h
CMCON_C1INV_LENGTH                       equ 0001h
CMCON_C1INV_MASK                         equ 0010h
CMCON_C2INV_POSN                         equ 0005h
CMCON_C2INV_POSITION                     equ 0005h
CMCON_C2INV_SIZE                         equ 0001h
CMCON_C2INV_LENGTH                       equ 0001h
CMCON_C2INV_MASK                         equ 0020h
CMCON_C1OUT_POSN                         equ 0006h
CMCON_C1OUT_POSITION                     equ 0006h
CMCON_C1OUT_SIZE                         equ 0001h
CMCON_C1OUT_LENGTH                       equ 0001h
CMCON_C1OUT_MASK                         equ 0040h
CMCON_C2OUT_POSN                         equ 0007h
CMCON_C2OUT_POSITION                     equ 0007h
CMCON_C2OUT_SIZE                         equ 0001h
CMCON_C2OUT_LENGTH                       equ 0001h
CMCON_C2OUT_MASK                         equ 0080h
CMCON_CM0_POSN                           equ 0000h
CMCON_CM0_POSITION                       equ 0000h
CMCON_CM0_SIZE                           equ 0001h
CMCON_CM0_LENGTH                         equ 0001h
CMCON_CM0_MASK                           equ 0001h
CMCON_CM1_POSN                           equ 0001h
CMCON_CM1_POSITION                       equ 0001h
CMCON_CM1_SIZE                           equ 0001h
CMCON_CM1_LENGTH                         equ 0001h
CMCON_CM1_MASK                           equ 0002h
CMCON_CM2_POSN                           equ 0002h
CMCON_CM2_POSITION                       equ 0002h
CMCON_CM2_SIZE                           equ 0001h
CMCON_CM2_LENGTH                         equ 0001h
CMCON_CM2_MASK                           equ 0004h
CMCON_CMEN0_POSN                         equ 0000h
CMCON_CMEN0_POSITION                     equ 0000h
CMCON_CMEN0_SIZE                         equ 0001h
CMCON_CMEN0_LENGTH                       equ 0001h
CMCON_CMEN0_MASK                         equ 0001h
CMCON_CMEN1_POSN                         equ 0001h
CMCON_CMEN1_POSITION                     equ 0001h
CMCON_CMEN1_SIZE                         equ 0001h
CMCON_CMEN1_LENGTH                       equ 0001h
CMCON_CMEN1_MASK                         equ 0002h
CMCON_CMEN2_POSN                         equ 0002h
CMCON_CMEN2_POSITION                     equ 0002h
CMCON_CMEN2_SIZE                         equ 0001h
CMCON_CMEN2_LENGTH                       equ 0001h
CMCON_CMEN2_MASK                         equ 0004h

// Register: CVRCON
#define CVRCON CVRCON
CVRCON                                   equ 0FB5h
// bitfield definitions
CVRCON_CVR_POSN                          equ 0000h
CVRCON_CVR_POSITION                      equ 0000h
CVRCON_CVR_SIZE                          equ 0004h
CVRCON_CVR_LENGTH                        equ 0004h
CVRCON_CVR_MASK                          equ 000Fh
CVRCON_CVRSS_POSN                        equ 0004h
CVRCON_CVRSS_POSITION                    equ 0004h
CVRCON_CVRSS_SIZE                        equ 0001h
CVRCON_CVRSS_LENGTH                      equ 0001h
CVRCON_CVRSS_MASK                        equ 0010h
CVRCON_CVRR_POSN                         equ 0005h
CVRCON_CVRR_POSITION                     equ 0005h
CVRCON_CVRR_SIZE                         equ 0001h
CVRCON_CVRR_LENGTH                       equ 0001h
CVRCON_CVRR_MASK                         equ 0020h
CVRCON_CVROE_POSN                        equ 0006h
CVRCON_CVROE_POSITION                    equ 0006h
CVRCON_CVROE_SIZE                        equ 0001h
CVRCON_CVROE_LENGTH                      equ 0001h
CVRCON_CVROE_MASK                        equ 0040h
CVRCON_CVREN_POSN                        equ 0007h
CVRCON_CVREN_POSITION                    equ 0007h
CVRCON_CVREN_SIZE                        equ 0001h
CVRCON_CVREN_LENGTH                      equ 0001h
CVRCON_CVREN_MASK                        equ 0080h
CVRCON_CVR0_POSN                         equ 0000h
CVRCON_CVR0_POSITION                     equ 0000h
CVRCON_CVR0_SIZE                         equ 0001h
CVRCON_CVR0_LENGTH                       equ 0001h
CVRCON_CVR0_MASK                         equ 0001h
CVRCON_CVR1_POSN                         equ 0001h
CVRCON_CVR1_POSITION                     equ 0001h
CVRCON_CVR1_SIZE                         equ 0001h
CVRCON_CVR1_LENGTH                       equ 0001h
CVRCON_CVR1_MASK                         equ 0002h
CVRCON_CVR2_POSN                         equ 0002h
CVRCON_CVR2_POSITION                     equ 0002h
CVRCON_CVR2_SIZE                         equ 0001h
CVRCON_CVR2_LENGTH                       equ 0001h
CVRCON_CVR2_MASK                         equ 0004h
CVRCON_CVR3_POSN                         equ 0003h
CVRCON_CVR3_POSITION                     equ 0003h
CVRCON_CVR3_SIZE                         equ 0001h
CVRCON_CVR3_LENGTH                       equ 0001h
CVRCON_CVR3_MASK                         equ 0008h
CVRCON_CVROEN_POSN                       equ 0006h
CVRCON_CVROEN_POSITION                   equ 0006h
CVRCON_CVROEN_SIZE                       equ 0001h
CVRCON_CVROEN_LENGTH                     equ 0001h
CVRCON_CVROEN_MASK                       equ 0040h

// Register: LCDSE1
#define LCDSE1 LCDSE1
LCDSE1                                   equ 0FB6h
// bitfield definitions
LCDSE1_LCDSE1_POSN                       equ 0000h
LCDSE1_LCDSE1_POSITION                   equ 0000h
LCDSE1_LCDSE1_SIZE                       equ 0008h
LCDSE1_LCDSE1_LENGTH                     equ 0008h
LCDSE1_LCDSE1_MASK                       equ 00FFh
LCDSE1_SE8_POSN                          equ 0000h
LCDSE1_SE8_POSITION                      equ 0000h
LCDSE1_SE8_SIZE                          equ 0001h
LCDSE1_SE8_LENGTH                        equ 0001h
LCDSE1_SE8_MASK                          equ 0001h
LCDSE1_SE9_POSN                          equ 0001h
LCDSE1_SE9_POSITION                      equ 0001h
LCDSE1_SE9_SIZE                          equ 0001h
LCDSE1_SE9_LENGTH                        equ 0001h
LCDSE1_SE9_MASK                          equ 0002h
LCDSE1_SE10_POSN                         equ 0002h
LCDSE1_SE10_POSITION                     equ 0002h
LCDSE1_SE10_SIZE                         equ 0001h
LCDSE1_SE10_LENGTH                       equ 0001h
LCDSE1_SE10_MASK                         equ 0004h
LCDSE1_SE11_POSN                         equ 0003h
LCDSE1_SE11_POSITION                     equ 0003h
LCDSE1_SE11_SIZE                         equ 0001h
LCDSE1_SE11_LENGTH                       equ 0001h
LCDSE1_SE11_MASK                         equ 0008h
LCDSE1_SE12_POSN                         equ 0004h
LCDSE1_SE12_POSITION                     equ 0004h
LCDSE1_SE12_SIZE                         equ 0001h
LCDSE1_SE12_LENGTH                       equ 0001h
LCDSE1_SE12_MASK                         equ 0010h
LCDSE1_SE13_POSN                         equ 0005h
LCDSE1_SE13_POSITION                     equ 0005h
LCDSE1_SE13_SIZE                         equ 0001h
LCDSE1_SE13_LENGTH                       equ 0001h
LCDSE1_SE13_MASK                         equ 0020h
LCDSE1_SE14_POSN                         equ 0006h
LCDSE1_SE14_POSITION                     equ 0006h
LCDSE1_SE14_SIZE                         equ 0001h
LCDSE1_SE14_LENGTH                       equ 0001h
LCDSE1_SE14_MASK                         equ 0040h
LCDSE1_SE15_POSN                         equ 0007h
LCDSE1_SE15_POSITION                     equ 0007h
LCDSE1_SE15_SIZE                         equ 0001h
LCDSE1_SE15_LENGTH                       equ 0001h
LCDSE1_SE15_MASK                         equ 0080h
LCDSE1_SEGEN8_POSN                       equ 0000h
LCDSE1_SEGEN8_POSITION                   equ 0000h
LCDSE1_SEGEN8_SIZE                       equ 0001h
LCDSE1_SEGEN8_LENGTH                     equ 0001h
LCDSE1_SEGEN8_MASK                       equ 0001h
LCDSE1_SEGEN9_POSN                       equ 0001h
LCDSE1_SEGEN9_POSITION                   equ 0001h
LCDSE1_SEGEN9_SIZE                       equ 0001h
LCDSE1_SEGEN9_LENGTH                     equ 0001h
LCDSE1_SEGEN9_MASK                       equ 0002h
LCDSE1_SEGEN10_POSN                      equ 0002h
LCDSE1_SEGEN10_POSITION                  equ 0002h
LCDSE1_SEGEN10_SIZE                      equ 0001h
LCDSE1_SEGEN10_LENGTH                    equ 0001h
LCDSE1_SEGEN10_MASK                      equ 0004h
LCDSE1_SEGEN11_POSN                      equ 0003h
LCDSE1_SEGEN11_POSITION                  equ 0003h
LCDSE1_SEGEN11_SIZE                      equ 0001h
LCDSE1_SEGEN11_LENGTH                    equ 0001h
LCDSE1_SEGEN11_MASK                      equ 0008h
LCDSE1_SEGEN12_POSN                      equ 0004h
LCDSE1_SEGEN12_POSITION                  equ 0004h
LCDSE1_SEGEN12_SIZE                      equ 0001h
LCDSE1_SEGEN12_LENGTH                    equ 0001h
LCDSE1_SEGEN12_MASK                      equ 0010h
LCDSE1_SEGEN13_POSN                      equ 0005h
LCDSE1_SEGEN13_POSITION                  equ 0005h
LCDSE1_SEGEN13_SIZE                      equ 0001h
LCDSE1_SEGEN13_LENGTH                    equ 0001h
LCDSE1_SEGEN13_MASK                      equ 0020h
LCDSE1_SEGEN14_POSN                      equ 0006h
LCDSE1_SEGEN14_POSITION                  equ 0006h
LCDSE1_SEGEN14_SIZE                      equ 0001h
LCDSE1_SEGEN14_LENGTH                    equ 0001h
LCDSE1_SEGEN14_MASK                      equ 0040h
LCDSE1_SEGEN15_POSN                      equ 0007h
LCDSE1_SEGEN15_POSITION                  equ 0007h
LCDSE1_SEGEN15_SIZE                      equ 0001h
LCDSE1_SEGEN15_LENGTH                    equ 0001h
LCDSE1_SEGEN15_MASK                      equ 0080h
LCDSE1_SE08_POSN                         equ 0000h
LCDSE1_SE08_POSITION                     equ 0000h
LCDSE1_SE08_SIZE                         equ 0001h
LCDSE1_SE08_LENGTH                       equ 0001h
LCDSE1_SE08_MASK                         equ 0001h
LCDSE1_SE09_POSN                         equ 0001h
LCDSE1_SE09_POSITION                     equ 0001h
LCDSE1_SE09_SIZE                         equ 0001h
LCDSE1_SE09_LENGTH                       equ 0001h
LCDSE1_SE09_MASK                         equ 0002h

// Register: LCDSE2
#define LCDSE2 LCDSE2
LCDSE2                                   equ 0FB7h
// bitfield definitions
LCDSE2_LCDSE2_POSN                       equ 0000h
LCDSE2_LCDSE2_POSITION                   equ 0000h
LCDSE2_LCDSE2_SIZE                       equ 0008h
LCDSE2_LCDSE2_LENGTH                     equ 0008h
LCDSE2_LCDSE2_MASK                       equ 00FFh
LCDSE2_SE16_POSN                         equ 0000h
LCDSE2_SE16_POSITION                     equ 0000h
LCDSE2_SE16_SIZE                         equ 0001h
LCDSE2_SE16_LENGTH                       equ 0001h
LCDSE2_SE16_MASK                         equ 0001h
LCDSE2_SE17_POSN                         equ 0001h
LCDSE2_SE17_POSITION                     equ 0001h
LCDSE2_SE17_SIZE                         equ 0001h
LCDSE2_SE17_LENGTH                       equ 0001h
LCDSE2_SE17_MASK                         equ 0002h
LCDSE2_SE18_POSN                         equ 0002h
LCDSE2_SE18_POSITION                     equ 0002h
LCDSE2_SE18_SIZE                         equ 0001h
LCDSE2_SE18_LENGTH                       equ 0001h
LCDSE2_SE18_MASK                         equ 0004h
LCDSE2_SE19_POSN                         equ 0003h
LCDSE2_SE19_POSITION                     equ 0003h
LCDSE2_SE19_SIZE                         equ 0001h
LCDSE2_SE19_LENGTH                       equ 0001h
LCDSE2_SE19_MASK                         equ 0008h
LCDSE2_SE20_POSN                         equ 0004h
LCDSE2_SE20_POSITION                     equ 0004h
LCDSE2_SE20_SIZE                         equ 0001h
LCDSE2_SE20_LENGTH                       equ 0001h
LCDSE2_SE20_MASK                         equ 0010h
LCDSE2_SE21_POSN                         equ 0005h
LCDSE2_SE21_POSITION                     equ 0005h
LCDSE2_SE21_SIZE                         equ 0001h
LCDSE2_SE21_LENGTH                       equ 0001h
LCDSE2_SE21_MASK                         equ 0020h
LCDSE2_SE22_POSN                         equ 0006h
LCDSE2_SE22_POSITION                     equ 0006h
LCDSE2_SE22_SIZE                         equ 0001h
LCDSE2_SE22_LENGTH                       equ 0001h
LCDSE2_SE22_MASK                         equ 0040h
LCDSE2_SE23_POSN                         equ 0007h
LCDSE2_SE23_POSITION                     equ 0007h
LCDSE2_SE23_SIZE                         equ 0001h
LCDSE2_SE23_LENGTH                       equ 0001h
LCDSE2_SE23_MASK                         equ 0080h
LCDSE2_SEGEN16_POSN                      equ 0000h
LCDSE2_SEGEN16_POSITION                  equ 0000h
LCDSE2_SEGEN16_SIZE                      equ 0001h
LCDSE2_SEGEN16_LENGTH                    equ 0001h
LCDSE2_SEGEN16_MASK                      equ 0001h
LCDSE2_SEGEN17_POSN                      equ 0001h
LCDSE2_SEGEN17_POSITION                  equ 0001h
LCDSE2_SEGEN17_SIZE                      equ 0001h
LCDSE2_SEGEN17_LENGTH                    equ 0001h
LCDSE2_SEGEN17_MASK                      equ 0002h
LCDSE2_SEGEN18_POSN                      equ 0002h
LCDSE2_SEGEN18_POSITION                  equ 0002h
LCDSE2_SEGEN18_SIZE                      equ 0001h
LCDSE2_SEGEN18_LENGTH                    equ 0001h
LCDSE2_SEGEN18_MASK                      equ 0004h
LCDSE2_SEGEN19_POSN                      equ 0003h
LCDSE2_SEGEN19_POSITION                  equ 0003h
LCDSE2_SEGEN19_SIZE                      equ 0001h
LCDSE2_SEGEN19_LENGTH                    equ 0001h
LCDSE2_SEGEN19_MASK                      equ 0008h
LCDSE2_SEGEN20_POSN                      equ 0004h
LCDSE2_SEGEN20_POSITION                  equ 0004h
LCDSE2_SEGEN20_SIZE                      equ 0001h
LCDSE2_SEGEN20_LENGTH                    equ 0001h
LCDSE2_SEGEN20_MASK                      equ 0010h
LCDSE2_SEGEN21_POSN                      equ 0005h
LCDSE2_SEGEN21_POSITION                  equ 0005h
LCDSE2_SEGEN21_SIZE                      equ 0001h
LCDSE2_SEGEN21_LENGTH                    equ 0001h
LCDSE2_SEGEN21_MASK                      equ 0020h
LCDSE2_SEGEN22_POSN                      equ 0006h
LCDSE2_SEGEN22_POSITION                  equ 0006h
LCDSE2_SEGEN22_SIZE                      equ 0001h
LCDSE2_SEGEN22_LENGTH                    equ 0001h
LCDSE2_SEGEN22_MASK                      equ 0040h
LCDSE2_SEGEN23_POSN                      equ 0007h
LCDSE2_SEGEN23_POSITION                  equ 0007h
LCDSE2_SEGEN23_SIZE                      equ 0001h
LCDSE2_SEGEN23_LENGTH                    equ 0001h
LCDSE2_SEGEN23_MASK                      equ 0080h

// Register: LCDSE3
#define LCDSE3 LCDSE3
LCDSE3                                   equ 0FB8h
// bitfield definitions
LCDSE3_LCDSE3_POSN                       equ 0000h
LCDSE3_LCDSE3_POSITION                   equ 0000h
LCDSE3_LCDSE3_SIZE                       equ 0008h
LCDSE3_LCDSE3_LENGTH                     equ 0008h
LCDSE3_LCDSE3_MASK                       equ 00FFh
LCDSE3_SE24_POSN                         equ 0000h
LCDSE3_SE24_POSITION                     equ 0000h
LCDSE3_SE24_SIZE                         equ 0001h
LCDSE3_SE24_LENGTH                       equ 0001h
LCDSE3_SE24_MASK                         equ 0001h
LCDSE3_SE25_POSN                         equ 0001h
LCDSE3_SE25_POSITION                     equ 0001h
LCDSE3_SE25_SIZE                         equ 0001h
LCDSE3_SE25_LENGTH                       equ 0001h
LCDSE3_SE25_MASK                         equ 0002h
LCDSE3_SE26_POSN                         equ 0002h
LCDSE3_SE26_POSITION                     equ 0002h
LCDSE3_SE26_SIZE                         equ 0001h
LCDSE3_SE26_LENGTH                       equ 0001h
LCDSE3_SE26_MASK                         equ 0004h
LCDSE3_SE27_POSN                         equ 0003h
LCDSE3_SE27_POSITION                     equ 0003h
LCDSE3_SE27_SIZE                         equ 0001h
LCDSE3_SE27_LENGTH                       equ 0001h
LCDSE3_SE27_MASK                         equ 0008h
LCDSE3_SE28_POSN                         equ 0004h
LCDSE3_SE28_POSITION                     equ 0004h
LCDSE3_SE28_SIZE                         equ 0001h
LCDSE3_SE28_LENGTH                       equ 0001h
LCDSE3_SE28_MASK                         equ 0010h
LCDSE3_SE29_POSN                         equ 0005h
LCDSE3_SE29_POSITION                     equ 0005h
LCDSE3_SE29_SIZE                         equ 0001h
LCDSE3_SE29_LENGTH                       equ 0001h
LCDSE3_SE29_MASK                         equ 0020h
LCDSE3_SE30_POSN                         equ 0006h
LCDSE3_SE30_POSITION                     equ 0006h
LCDSE3_SE30_SIZE                         equ 0001h
LCDSE3_SE30_LENGTH                       equ 0001h
LCDSE3_SE30_MASK                         equ 0040h
LCDSE3_SE31_POSN                         equ 0007h
LCDSE3_SE31_POSITION                     equ 0007h
LCDSE3_SE31_SIZE                         equ 0001h
LCDSE3_SE31_LENGTH                       equ 0001h
LCDSE3_SE31_MASK                         equ 0080h
LCDSE3_SEGEN24_POSN                      equ 0000h
LCDSE3_SEGEN24_POSITION                  equ 0000h
LCDSE3_SEGEN24_SIZE                      equ 0001h
LCDSE3_SEGEN24_LENGTH                    equ 0001h
LCDSE3_SEGEN24_MASK                      equ 0001h
LCDSE3_SEGEN25_POSN                      equ 0001h
LCDSE3_SEGEN25_POSITION                  equ 0001h
LCDSE3_SEGEN25_SIZE                      equ 0001h
LCDSE3_SEGEN25_LENGTH                    equ 0001h
LCDSE3_SEGEN25_MASK                      equ 0002h
LCDSE3_SEGEN26_POSN                      equ 0002h
LCDSE3_SEGEN26_POSITION                  equ 0002h
LCDSE3_SEGEN26_SIZE                      equ 0001h
LCDSE3_SEGEN26_LENGTH                    equ 0001h
LCDSE3_SEGEN26_MASK                      equ 0004h
LCDSE3_SEGEN27_POSN                      equ 0003h
LCDSE3_SEGEN27_POSITION                  equ 0003h
LCDSE3_SEGEN27_SIZE                      equ 0001h
LCDSE3_SEGEN27_LENGTH                    equ 0001h
LCDSE3_SEGEN27_MASK                      equ 0008h
LCDSE3_SEGEN28_POSN                      equ 0004h
LCDSE3_SEGEN28_POSITION                  equ 0004h
LCDSE3_SEGEN28_SIZE                      equ 0001h
LCDSE3_SEGEN28_LENGTH                    equ 0001h
LCDSE3_SEGEN28_MASK                      equ 0010h
LCDSE3_SEGEN29_POSN                      equ 0005h
LCDSE3_SEGEN29_POSITION                  equ 0005h
LCDSE3_SEGEN29_SIZE                      equ 0001h
LCDSE3_SEGEN29_LENGTH                    equ 0001h
LCDSE3_SEGEN29_MASK                      equ 0020h
LCDSE3_SEGEN30_POSN                      equ 0006h
LCDSE3_SEGEN30_POSITION                  equ 0006h
LCDSE3_SEGEN30_SIZE                      equ 0001h
LCDSE3_SEGEN30_LENGTH                    equ 0001h
LCDSE3_SEGEN30_MASK                      equ 0040h
LCDSE3_SEGEN31_POSN                      equ 0007h
LCDSE3_SEGEN31_POSITION                  equ 0007h
LCDSE3_SEGEN31_SIZE                      equ 0001h
LCDSE3_SEGEN31_LENGTH                    equ 0001h
LCDSE3_SEGEN31_MASK                      equ 0080h

