GopalSaraf/Practicals/PSDL/include/proc/pic18f85j90.inc
// Register: LCDDATA2
#define LCDDATA2 LCDDATA2
LCDDATA2                                 equ 0FBDh
// bitfield definitions
LCDDATA2_LCDDATA2_POSN                   equ 0000h
LCDDATA2_LCDDATA2_POSITION               equ 0000h
LCDDATA2_LCDDATA2_SIZE                   equ 0008h
LCDDATA2_LCDDATA2_LENGTH                 equ 0008h
LCDDATA2_LCDDATA2_MASK                   equ 00FFh
LCDDATA2_S16C0_POSN                      equ 0000h
LCDDATA2_S16C0_POSITION                  equ 0000h
LCDDATA2_S16C0_SIZE                      equ 0001h
LCDDATA2_S16C0_LENGTH                    equ 0001h
LCDDATA2_S16C0_MASK                      equ 0001h
LCDDATA2_S17C0_POSN                      equ 0001h
LCDDATA2_S17C0_POSITION                  equ 0001h
LCDDATA2_S17C0_SIZE                      equ 0001h
LCDDATA2_S17C0_LENGTH                    equ 0001h
LCDDATA2_S17C0_MASK                      equ 0002h
LCDDATA2_S18C0_POSN                      equ 0002h
LCDDATA2_S18C0_POSITION                  equ 0002h
LCDDATA2_S18C0_SIZE                      equ 0001h
LCDDATA2_S18C0_LENGTH                    equ 0001h
LCDDATA2_S18C0_MASK                      equ 0004h
LCDDATA2_S19C0_POSN                      equ 0003h
LCDDATA2_S19C0_POSITION                  equ 0003h
LCDDATA2_S19C0_SIZE                      equ 0001h
LCDDATA2_S19C0_LENGTH                    equ 0001h
LCDDATA2_S19C0_MASK                      equ 0008h
LCDDATA2_S20C0_POSN                      equ 0004h
LCDDATA2_S20C0_POSITION                  equ 0004h
LCDDATA2_S20C0_SIZE                      equ 0001h
LCDDATA2_S20C0_LENGTH                    equ 0001h
LCDDATA2_S20C0_MASK                      equ 0010h
LCDDATA2_S21C0_POSN                      equ 0005h
LCDDATA2_S21C0_POSITION                  equ 0005h
LCDDATA2_S21C0_SIZE                      equ 0001h
LCDDATA2_S21C0_LENGTH                    equ 0001h
LCDDATA2_S21C0_MASK                      equ 0020h
LCDDATA2_S22C0_POSN                      equ 0006h
LCDDATA2_S22C0_POSITION                  equ 0006h
LCDDATA2_S22C0_SIZE                      equ 0001h
LCDDATA2_S22C0_LENGTH                    equ 0001h
LCDDATA2_S22C0_MASK                      equ 0040h
LCDDATA2_S23C0_POSN                      equ 0007h
LCDDATA2_S23C0_POSITION                  equ 0007h
LCDDATA2_S23C0_SIZE                      equ 0001h
LCDDATA2_S23C0_LENGTH                    equ 0001h
LCDDATA2_S23C0_MASK                      equ 0080h
LCDDATA2_SEG16COM0_POSN                  equ 0000h
LCDDATA2_SEG16COM0_POSITION              equ 0000h
LCDDATA2_SEG16COM0_SIZE                  equ 0001h
LCDDATA2_SEG16COM0_LENGTH                equ 0001h
LCDDATA2_SEG16COM0_MASK                  equ 0001h
LCDDATA2_SEG17COM0_POSN                  equ 0001h
LCDDATA2_SEG17COM0_POSITION              equ 0001h
LCDDATA2_SEG17COM0_SIZE                  equ 0001h
LCDDATA2_SEG17COM0_LENGTH                equ 0001h
LCDDATA2_SEG17COM0_MASK                  equ 0002h
LCDDATA2_SEG18COM0_POSN                  equ 0002h
LCDDATA2_SEG18COM0_POSITION              equ 0002h
LCDDATA2_SEG18COM0_SIZE                  equ 0001h
LCDDATA2_SEG18COM0_LENGTH                equ 0001h
LCDDATA2_SEG18COM0_MASK                  equ 0004h
LCDDATA2_SEG19COM0_POSN                  equ 0003h
LCDDATA2_SEG19COM0_POSITION              equ 0003h
LCDDATA2_SEG19COM0_SIZE                  equ 0001h
LCDDATA2_SEG19COM0_LENGTH                equ 0001h
LCDDATA2_SEG19COM0_MASK                  equ 0008h
LCDDATA2_SEG20COM0_POSN                  equ 0004h
LCDDATA2_SEG20COM0_POSITION              equ 0004h
LCDDATA2_SEG20COM0_SIZE                  equ 0001h
LCDDATA2_SEG20COM0_LENGTH                equ 0001h
LCDDATA2_SEG20COM0_MASK                  equ 0010h
LCDDATA2_SEG21COM0_POSN                  equ 0005h
LCDDATA2_SEG21COM0_POSITION              equ 0005h
LCDDATA2_SEG21COM0_SIZE                  equ 0001h
LCDDATA2_SEG21COM0_LENGTH                equ 0001h
LCDDATA2_SEG21COM0_MASK                  equ 0020h
LCDDATA2_SEG22COM0_POSN                  equ 0006h
LCDDATA2_SEG22COM0_POSITION              equ 0006h
LCDDATA2_SEG22COM0_SIZE                  equ 0001h
LCDDATA2_SEG22COM0_LENGTH                equ 0001h
LCDDATA2_SEG22COM0_MASK                  equ 0040h
LCDDATA2_SEG23COM0_POSN                  equ 0007h
LCDDATA2_SEG23COM0_POSITION              equ 0007h
LCDDATA2_SEG23COM0_SIZE                  equ 0001h
LCDDATA2_SEG23COM0_LENGTH                equ 0001h
LCDDATA2_SEG23COM0_MASK                  equ 0080h

// Register: LCDDATA3
#define LCDDATA3 LCDDATA3
LCDDATA3                                 equ 0FBEh
// bitfield definitions
LCDDATA3_LCDDATA3_POSN                   equ 0000h
LCDDATA3_LCDDATA3_POSITION               equ 0000h
LCDDATA3_LCDDATA3_SIZE                   equ 0008h
LCDDATA3_LCDDATA3_LENGTH                 equ 0008h
LCDDATA3_LCDDATA3_MASK                   equ 00FFh
LCDDATA3_S24C0_POSN                      equ 0000h
LCDDATA3_S24C0_POSITION                  equ 0000h
LCDDATA3_S24C0_SIZE                      equ 0001h
LCDDATA3_S24C0_LENGTH                    equ 0001h
LCDDATA3_S24C0_MASK                      equ 0001h
LCDDATA3_S25C0_POSN                      equ 0001h
LCDDATA3_S25C0_POSITION                  equ 0001h
LCDDATA3_S25C0_SIZE                      equ 0001h
LCDDATA3_S25C0_LENGTH                    equ 0001h
LCDDATA3_S25C0_MASK                      equ 0002h
LCDDATA3_S26C0_POSN                      equ 0002h
LCDDATA3_S26C0_POSITION                  equ 0002h
LCDDATA3_S26C0_SIZE                      equ 0001h
LCDDATA3_S26C0_LENGTH                    equ 0001h
LCDDATA3_S26C0_MASK                      equ 0004h
LCDDATA3_S27C0_POSN                      equ 0003h
LCDDATA3_S27C0_POSITION                  equ 0003h
LCDDATA3_S27C0_SIZE                      equ 0001h
LCDDATA3_S27C0_LENGTH                    equ 0001h
LCDDATA3_S27C0_MASK                      equ 0008h
LCDDATA3_S28C0_POSN                      equ 0004h
LCDDATA3_S28C0_POSITION                  equ 0004h
LCDDATA3_S28C0_SIZE                      equ 0001h
LCDDATA3_S28C0_LENGTH                    equ 0001h
LCDDATA3_S28C0_MASK                      equ 0010h
LCDDATA3_S29C0_POSN                      equ 0005h
LCDDATA3_S29C0_POSITION                  equ 0005h
LCDDATA3_S29C0_SIZE                      equ 0001h
LCDDATA3_S29C0_LENGTH                    equ 0001h
LCDDATA3_S29C0_MASK                      equ 0020h
LCDDATA3_S30C0_POSN                      equ 0006h
LCDDATA3_S30C0_POSITION                  equ 0006h
LCDDATA3_S30C0_SIZE                      equ 0001h
LCDDATA3_S30C0_LENGTH                    equ 0001h
LCDDATA3_S30C0_MASK                      equ 0040h
LCDDATA3_S31C0_POSN                      equ 0007h
LCDDATA3_S31C0_POSITION                  equ 0007h
LCDDATA3_S31C0_SIZE                      equ 0001h
LCDDATA3_S31C0_LENGTH                    equ 0001h
LCDDATA3_S31C0_MASK                      equ 0080h
LCDDATA3_SEG24COM0_POSN                  equ 0000h
LCDDATA3_SEG24COM0_POSITION              equ 0000h
LCDDATA3_SEG24COM0_SIZE                  equ 0001h
LCDDATA3_SEG24COM0_LENGTH                equ 0001h
LCDDATA3_SEG24COM0_MASK                  equ 0001h
LCDDATA3_SEG25COM0_POSN                  equ 0001h
LCDDATA3_SEG25COM0_POSITION              equ 0001h
LCDDATA3_SEG25COM0_SIZE                  equ 0001h
LCDDATA3_SEG25COM0_LENGTH                equ 0001h
LCDDATA3_SEG25COM0_MASK                  equ 0002h
LCDDATA3_SEG26COM0_POSN                  equ 0002h
LCDDATA3_SEG26COM0_POSITION              equ 0002h
LCDDATA3_SEG26COM0_SIZE                  equ 0001h
LCDDATA3_SEG26COM0_LENGTH                equ 0001h
LCDDATA3_SEG26COM0_MASK                  equ 0004h
LCDDATA3_SEG27COM0_POSN                  equ 0003h
LCDDATA3_SEG27COM0_POSITION              equ 0003h
LCDDATA3_SEG27COM0_SIZE                  equ 0001h
LCDDATA3_SEG27COM0_LENGTH                equ 0001h
LCDDATA3_SEG27COM0_MASK                  equ 0008h
LCDDATA3_SEG28COM0_POSN                  equ 0004h
LCDDATA3_SEG28COM0_POSITION              equ 0004h
LCDDATA3_SEG28COM0_SIZE                  equ 0001h
LCDDATA3_SEG28COM0_LENGTH                equ 0001h
LCDDATA3_SEG28COM0_MASK                  equ 0010h
LCDDATA3_SEG29COM0_POSN                  equ 0005h
LCDDATA3_SEG29COM0_POSITION              equ 0005h
LCDDATA3_SEG29COM0_SIZE                  equ 0001h
LCDDATA3_SEG29COM0_LENGTH                equ 0001h
LCDDATA3_SEG29COM0_MASK                  equ 0020h
LCDDATA3_SEG30COM0_POSN                  equ 0006h
LCDDATA3_SEG30COM0_POSITION              equ 0006h
LCDDATA3_SEG30COM0_SIZE                  equ 0001h
LCDDATA3_SEG30COM0_LENGTH                equ 0001h
LCDDATA3_SEG30COM0_MASK                  equ 0040h
LCDDATA3_SEG31COM0_POSN                  equ 0007h
LCDDATA3_SEG31COM0_POSITION              equ 0007h
LCDDATA3_SEG31COM0_SIZE                  equ 0001h
LCDDATA3_SEG31COM0_LENGTH                equ 0001h
LCDDATA3_SEG31COM0_MASK                  equ 0080h

